program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3510.2.1"}, {"coremlc-version", "3500.32.1"}, {"coremltools-component-torch", "1.13.0"}, {"coremltools-source-dialect", "TorchScript"}, {"coremltools-version", "7.1"}})]
{
    func main<ios15>(tensor<fp32, [1, 3, 256, 256]> image) {
            tensor<fp32, []> image__scaled___y_0 = const()[name = tensor<string, []>("image__scaled___y_0"), val = tensor<fp32, []>(0x1.010102p-8)];
            tensor<fp32, [1, 3, 256, 256]> image__scaled__ = mul(x = image, y = image__scaled___y_0)[name = tensor<string, []>("image__scaled__")];
            tensor<int32, []> var_3 = const()[name = tensor<string, []>("op_3"), val = tensor<int32, []>(64)];
            tensor<int32, []> var_5 = const()[name = tensor<string, []>("op_5"), val = tensor<int32, []>(1)];
            tensor<bool, []> var_7 = const()[name = tensor<string, []>("op_7"), val = tensor<bool, []>(false)];
            tensor<bool, []> var_8 = const()[name = tensor<string, []>("op_8"), val = tensor<bool, []>(true)];
            tensor<int32, []> var_15 = const()[name = tensor<string, []>("op_15"), val = tensor<int32, []>(128)];
            tensor<int32, []> var_16 = const()[name = tensor<string, []>("op_16"), val = tensor<int32, []>(256)];
            tensor<int32, []> var_17 = const()[name = tensor<string, []>("op_17"), val = tensor<int32, []>(512)];
            tensor<int32, []> var_21 = const()[name = tensor<string, []>("op_21"), val = tensor<int32, []>(-1)];
            tensor<int32, [2]> var_49 = const()[name = tensor<string, []>("op_49"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> var_51 = const()[name = tensor<string, []>("op_51"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input0_4_pad_type_0 = const()[name = tensor<string, []>("input0_4_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input0_4_pad_0 = const()[name = tensor<string, []>("input0_4_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<string, []> image_to_fp16_dtype_0 = const()[name = tensor<string, []>("image_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, [64, 3, 3, 3]> image_encoder_model_patch_embed_0_reparam_conv_weight_to_fp16 = const()[name = tensor<string, []>("image_encoder_model_patch_embed_0_reparam_conv_weight_to_fp16"), val = tensor<fp16, [64, 3, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [64]> image_encoder_model_patch_embed_0_reparam_conv_bias_to_fp16 = const()[name = tensor<string, []>("image_encoder_model_patch_embed_0_reparam_conv_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3584)))];
            tensor<fp16, [1, 3, 256, 256]> cast_10 = cast(dtype = image_to_fp16_dtype_0, x = image__scaled__)[name = tensor<string, []>("cast_10")];
            tensor<fp16, [1, 64, 128, 128]> input0_4_cast_fp16 = conv(bias = image_encoder_model_patch_embed_0_reparam_conv_bias_to_fp16, dilations = var_51, groups = var_5, pad = input0_4_pad_0, pad_type = input0_4_pad_type_0, strides = var_49, weight = image_encoder_model_patch_embed_0_reparam_conv_weight_to_fp16, x = cast_10)[name = tensor<string, []>("input0_4_cast_fp16")];
            tensor<string, []> var_54_mode_0 = const()[name = tensor<string, []>("op_54_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 64, 128, 128]> var_54_cast_fp16 = gelu(mode = var_54_mode_0, x = input0_4_cast_fp16)[name = tensor<string, []>("op_54_cast_fp16")];
            tensor<int32, [2]> var_58 = const()[name = tensor<string, []>("op_58"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> var_60 = const()[name = tensor<string, []>("op_60"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_127_pad_type_0 = const()[name = tensor<string, []>("input_127_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_127_pad_0 = const()[name = tensor<string, []>("input_127_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [64, 1, 3, 3]> image_encoder_model_patch_embed_1_reparam_conv_weight_to_fp16 = const()[name = tensor<string, []>("image_encoder_model_patch_embed_1_reparam_conv_weight_to_fp16"), val = tensor<fp16, [64, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3776)))];
            tensor<fp16, [64]> image_encoder_model_patch_embed_1_reparam_conv_bias_to_fp16 = const()[name = tensor<string, []>("image_encoder_model_patch_embed_1_reparam_conv_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4992)))];
            tensor<fp16, [1, 64, 64, 64]> input_127_cast_fp16 = conv(bias = image_encoder_model_patch_embed_1_reparam_conv_bias_to_fp16, dilations = var_60, groups = var_3, pad = input_127_pad_0, pad_type = input_127_pad_type_0, strides = var_58, weight = image_encoder_model_patch_embed_1_reparam_conv_weight_to_fp16, x = var_54_cast_fp16)[name = tensor<string, []>("input_127_cast_fp16")];
            tensor<string, []> var_63_mode_0 = const()[name = tensor<string, []>("op_63_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 64, 64, 64]> var_63_cast_fp16 = gelu(mode = var_63_mode_0, x = input_127_cast_fp16)[name = tensor<string, []>("op_63_cast_fp16")];
            tensor<int32, [2]> var_67 = const()[name = tensor<string, []>("op_67"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_69 = const()[name = tensor<string, []>("op_69"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_131_pad_type_0 = const()[name = tensor<string, []>("input_131_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_131_pad_0 = const()[name = tensor<string, []>("input_131_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [64, 64, 1, 1]> image_encoder_model_patch_embed_2_reparam_conv_weight_to_fp16 = const()[name = tensor<string, []>("image_encoder_model_patch_embed_2_reparam_conv_weight_to_fp16"), val = tensor<fp16, [64, 64, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5184)))];
            tensor<fp16, [64]> image_encoder_model_patch_embed_2_reparam_conv_bias_to_fp16 = const()[name = tensor<string, []>("image_encoder_model_patch_embed_2_reparam_conv_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(13440)))];
            tensor<fp16, [1, 64, 64, 64]> input_131_cast_fp16 = conv(bias = image_encoder_model_patch_embed_2_reparam_conv_bias_to_fp16, dilations = var_69, groups = var_5, pad = input_131_pad_0, pad_type = input_131_pad_type_0, strides = var_67, weight = image_encoder_model_patch_embed_2_reparam_conv_weight_to_fp16, x = var_63_cast_fp16)[name = tensor<string, []>("input_131_cast_fp16")];
            tensor<string, []> var_72_mode_0 = const()[name = tensor<string, []>("op_72_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 64, 64, 64]> var_72_cast_fp16 = gelu(mode = var_72_mode_0, x = input_131_cast_fp16)[name = tensor<string, []>("op_72_cast_fp16")];
            tensor<int32, [2]> var_81 = const()[name = tensor<string, []>("op_81"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_83 = const()[name = tensor<string, []>("op_83"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_19_pad_type_0 = const()[name = tensor<string, []>("input_19_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_19_pad_0 = const()[name = tensor<string, []>("input_19_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [64, 1, 3, 3]> image_encoder_model_network_0_0_token_mixer_reparam_conv_weight_to_fp16 = const()[name = tensor<string, []>("image_encoder_model_network_0_0_token_mixer_reparam_conv_weight_to_fp16"), val = tensor<fp16, [64, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(13632)))];
            tensor<fp16, [64]> image_encoder_model_network_0_0_token_mixer_reparam_conv_bias_to_fp16 = const()[name = tensor<string, []>("image_encoder_model_network_0_0_token_mixer_reparam_conv_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(14848)))];
            tensor<fp16, [1, 64, 64, 64]> input_19_cast_fp16 = conv(bias = image_encoder_model_network_0_0_token_mixer_reparam_conv_bias_to_fp16, dilations = var_83, groups = var_3, pad = input_19_pad_0, pad_type = input_19_pad_type_0, strides = var_81, weight = image_encoder_model_network_0_0_token_mixer_reparam_conv_weight_to_fp16, x = var_72_cast_fp16)[name = tensor<string, []>("input_19_cast_fp16")];
            tensor<int32, [2]> var_92 = const()[name = tensor<string, []>("op_92"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_94 = const()[name = tensor<string, []>("op_94"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_21_pad_type_0 = const()[name = tensor<string, []>("input_21_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_21_pad_0 = const()[name = tensor<string, []>("input_21_pad_0"), val = tensor<int32, [4]>([3, 3, 3, 3])];
            tensor<fp16, [64, 1, 7, 7]> input_23_weight_0_to_fp16 = const()[name = tensor<string, []>("input_23_weight_0_to_fp16"), val = tensor<fp16, [64, 1, 7, 7]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(15040)))];
            tensor<fp16, [64]> input_23_bias_0_to_fp16 = const()[name = tensor<string, []>("input_23_bias_0_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(21376)))];
            tensor<fp16, [1, 64, 64, 64]> input_23_cast_fp16 = conv(bias = input_23_bias_0_to_fp16, dilations = var_94, groups = var_3, pad = input_21_pad_0, pad_type = input_21_pad_type_0, strides = var_92, weight = input_23_weight_0_to_fp16, x = input_19_cast_fp16)[name = tensor<string, []>("input_23_cast_fp16")];
            tensor<int32, [2]> var_104 = const()[name = tensor<string, []>("op_104"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_106 = const()[name = tensor<string, []>("op_106"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_25_pad_type_0 = const()[name = tensor<string, []>("input_25_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_25_pad_0 = const()[name = tensor<string, []>("input_25_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [192, 64, 1, 1]> image_encoder_model_network_0_0_convffn_fc1_weight_to_fp16 = const()[name = tensor<string, []>("image_encoder_model_network_0_0_convffn_fc1_weight_to_fp16"), val = tensor<fp16, [192, 64, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(21568)))];
            tensor<fp16, [192]> image_encoder_model_network_0_0_convffn_fc1_bias_to_fp16 = const()[name = tensor<string, []>("image_encoder_model_network_0_0_convffn_fc1_bias_to_fp16"), val = tensor<fp16, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(46208)))];
            tensor<fp16, [1, 192, 64, 64]> input_25_cast_fp16 = conv(bias = image_encoder_model_network_0_0_convffn_fc1_bias_to_fp16, dilations = var_106, groups = var_5, pad = input_25_pad_0, pad_type = input_25_pad_type_0, strides = var_104, weight = image_encoder_model_network_0_0_convffn_fc1_weight_to_fp16, x = input_23_cast_fp16)[name = tensor<string, []>("input_25_cast_fp16")];
            tensor<string, []> var_109_mode_0 = const()[name = tensor<string, []>("op_109_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 192, 64, 64]> var_109_cast_fp16 = gelu(mode = var_109_mode_0, x = input_25_cast_fp16)[name = tensor<string, []>("op_109_cast_fp16")];
            tensor<int32, [2]> var_113 = const()[name = tensor<string, []>("op_113"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_115 = const()[name = tensor<string, []>("op_115"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_29_pad_type_0 = const()[name = tensor<string, []>("input_29_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_29_pad_0 = const()[name = tensor<string, []>("input_29_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [64, 192, 1, 1]> var_119_weight_0_to_fp16 = const()[name = tensor<string, []>("op_119_weight_0_to_fp16"), val = tensor<fp16, [64, 192, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(46656)))];
            tensor<fp16, [64]> var_119_bias_0_to_fp16 = const()[name = tensor<string, []>("op_119_bias_0_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(71296)))];
            tensor<fp16, [1, 64, 64, 64]> var_119_cast_fp16 = conv(bias = var_119_bias_0_to_fp16, dilations = var_115, groups = var_5, pad = input_29_pad_0, pad_type = input_29_pad_type_0, strides = var_113, weight = var_119_weight_0_to_fp16, x = var_109_cast_fp16)[name = tensor<string, []>("op_119_cast_fp16")];
            tensor<fp16, [1, 64, 64, 64]> var_120_cast_fp16 = add(x = input_19_cast_fp16, y = var_119_cast_fp16)[name = tensor<string, []>("op_120_cast_fp16")];
            tensor<int32, [2]> var_127 = const()[name = tensor<string, []>("op_127"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_129 = const()[name = tensor<string, []>("op_129"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_31_pad_type_0 = const()[name = tensor<string, []>("input_31_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_31_pad_0 = const()[name = tensor<string, []>("input_31_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [64, 1, 3, 3]> image_encoder_model_network_0_1_token_mixer_reparam_conv_weight_to_fp16 = const()[name = tensor<string, []>("image_encoder_model_network_0_1_token_mixer_reparam_conv_weight_to_fp16"), val = tensor<fp16, [64, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(71488)))];
            tensor<fp16, [64]> image_encoder_model_network_0_1_token_mixer_reparam_conv_bias_to_fp16 = const()[name = tensor<string, []>("image_encoder_model_network_0_1_token_mixer_reparam_conv_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(72704)))];
            tensor<fp16, [1, 64, 64, 64]> input_31_cast_fp16 = conv(bias = image_encoder_model_network_0_1_token_mixer_reparam_conv_bias_to_fp16, dilations = var_129, groups = var_3, pad = input_31_pad_0, pad_type = input_31_pad_type_0, strides = var_127, weight = image_encoder_model_network_0_1_token_mixer_reparam_conv_weight_to_fp16, x = var_120_cast_fp16)[name = tensor<string, []>("input_31_cast_fp16")];
            tensor<int32, [2]> var_138 = const()[name = tensor<string, []>("op_138"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_140 = const()[name = tensor<string, []>("op_140"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_133_pad_type_0 = const()[name = tensor<string, []>("input_133_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_133_pad_0 = const()[name = tensor<string, []>("input_133_pad_0"), val = tensor<int32, [4]>([3, 3, 3, 3])];
            tensor<fp16, [64, 1, 7, 7]> input_35_weight_0_to_fp16 = const()[name = tensor<string, []>("input_35_weight_0_to_fp16"), val = tensor<fp16, [64, 1, 7, 7]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(72896)))];
            tensor<fp16, [64]> input_35_bias_0_to_fp16 = const()[name = tensor<string, []>("input_35_bias_0_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(79232)))];
            tensor<fp16, [1, 64, 64, 64]> input_35_cast_fp16 = conv(bias = input_35_bias_0_to_fp16, dilations = var_140, groups = var_3, pad = input_133_pad_0, pad_type = input_133_pad_type_0, strides = var_138, weight = input_35_weight_0_to_fp16, x = input_31_cast_fp16)[name = tensor<string, []>("input_35_cast_fp16")];
            tensor<int32, [2]> var_150 = const()[name = tensor<string, []>("op_150"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_152 = const()[name = tensor<string, []>("op_152"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_37_pad_type_0 = const()[name = tensor<string, []>("input_37_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_37_pad_0 = const()[name = tensor<string, []>("input_37_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [192, 64, 1, 1]> image_encoder_model_network_0_1_convffn_fc1_weight_to_fp16 = const()[name = tensor<string, []>("image_encoder_model_network_0_1_convffn_fc1_weight_to_fp16"), val = tensor<fp16, [192, 64, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(79424)))];
            tensor<fp16, [192]> image_encoder_model_network_0_1_convffn_fc1_bias_to_fp16 = const()[name = tensor<string, []>("image_encoder_model_network_0_1_convffn_fc1_bias_to_fp16"), val = tensor<fp16, [192]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(104064)))];
            tensor<fp16, [1, 192, 64, 64]> input_37_cast_fp16 = conv(bias = image_encoder_model_network_0_1_convffn_fc1_bias_to_fp16, dilations = var_152, groups = var_5, pad = input_37_pad_0, pad_type = input_37_pad_type_0, strides = var_150, weight = image_encoder_model_network_0_1_convffn_fc1_weight_to_fp16, x = input_35_cast_fp16)[name = tensor<string, []>("input_37_cast_fp16")];
            tensor<string, []> var_155_mode_0 = const()[name = tensor<string, []>("op_155_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 192, 64, 64]> var_155_cast_fp16 = gelu(mode = var_155_mode_0, x = input_37_cast_fp16)[name = tensor<string, []>("op_155_cast_fp16")];
            tensor<int32, [2]> var_159 = const()[name = tensor<string, []>("op_159"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_161 = const()[name = tensor<string, []>("op_161"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_135_pad_type_0 = const()[name = tensor<string, []>("input_135_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_135_pad_0 = const()[name = tensor<string, []>("input_135_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [64, 192, 1, 1]> var_165_weight_0_to_fp16 = const()[name = tensor<string, []>("op_165_weight_0_to_fp16"), val = tensor<fp16, [64, 192, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(104512)))];
            tensor<fp16, [64]> var_165_bias_0_to_fp16 = const()[name = tensor<string, []>("op_165_bias_0_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(129152)))];
            tensor<fp16, [1, 64, 64, 64]> var_165_cast_fp16 = conv(bias = var_165_bias_0_to_fp16, dilations = var_161, groups = var_5, pad = input_135_pad_0, pad_type = input_135_pad_type_0, strides = var_159, weight = var_165_weight_0_to_fp16, x = var_155_cast_fp16)[name = tensor<string, []>("op_165_cast_fp16")];
            tensor<fp16, [1, 64, 64, 64]> var_166_cast_fp16 = add(x = input_31_cast_fp16, y = var_165_cast_fp16)[name = tensor<string, []>("op_166_cast_fp16")];
            tensor<int32, [2]> var_173 = const()[name = tensor<string, []>("op_173"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> var_175 = const()[name = tensor<string, []>("op_175"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_33_pad_type_0 = const()[name = tensor<string, []>("input_33_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_33_pad_0 = const()[name = tensor<string, []>("input_33_pad_0"), val = tensor<int32, [4]>([3, 3, 3, 3])];
            tensor<fp16, [128, 1, 7, 7]> image_encoder_model_network_1_proj_0_lkb_reparam_weight_to_fp16 = const()[name = tensor<string, []>("image_encoder_model_network_1_proj_0_lkb_reparam_weight_to_fp16"), val = tensor<fp16, [128, 1, 7, 7]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(129344)))];
            tensor<fp16, [128]> image_encoder_model_network_1_proj_0_lkb_reparam_bias_to_fp16 = const()[name = tensor<string, []>("image_encoder_model_network_1_proj_0_lkb_reparam_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(141952)))];
            tensor<fp16, [1, 128, 32, 32]> input_33_cast_fp16 = conv(bias = image_encoder_model_network_1_proj_0_lkb_reparam_bias_to_fp16, dilations = var_175, groups = var_3, pad = input_33_pad_0, pad_type = input_33_pad_type_0, strides = var_173, weight = image_encoder_model_network_1_proj_0_lkb_reparam_weight_to_fp16, x = var_166_cast_fp16)[name = tensor<string, []>("input_33_cast_fp16")];
            tensor<string, []> var_178_mode_0 = const()[name = tensor<string, []>("op_178_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 128, 32, 32]> var_178_cast_fp16 = gelu(mode = var_178_mode_0, x = input_33_cast_fp16)[name = tensor<string, []>("op_178_cast_fp16")];
            tensor<int32, [2]> var_182 = const()[name = tensor<string, []>("op_182"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_184 = const()[name = tensor<string, []>("op_184"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_41_pad_type_0 = const()[name = tensor<string, []>("input_41_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_41_pad_0 = const()[name = tensor<string, []>("input_41_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [128, 128, 1, 1]> image_encoder_model_network_1_proj_1_reparam_conv_weight_to_fp16 = const()[name = tensor<string, []>("image_encoder_model_network_1_proj_1_reparam_conv_weight_to_fp16"), val = tensor<fp16, [128, 128, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(142272)))];
            tensor<fp16, [128]> image_encoder_model_network_1_proj_1_reparam_conv_bias_to_fp16 = const()[name = tensor<string, []>("image_encoder_model_network_1_proj_1_reparam_conv_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(175104)))];
            tensor<fp16, [1, 128, 32, 32]> input_41_cast_fp16 = conv(bias = image_encoder_model_network_1_proj_1_reparam_conv_bias_to_fp16, dilations = var_184, groups = var_5, pad = input_41_pad_0, pad_type = input_41_pad_type_0, strides = var_182, weight = image_encoder_model_network_1_proj_1_reparam_conv_weight_to_fp16, x = var_178_cast_fp16)[name = tensor<string, []>("input_41_cast_fp16")];
            tensor<string, []> var_187_mode_0 = const()[name = tensor<string, []>("op_187_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 128, 32, 32]> var_187_cast_fp16 = gelu(mode = var_187_mode_0, x = input_41_cast_fp16)[name = tensor<string, []>("op_187_cast_fp16")];
            tensor<int32, [2]> var_200 = const()[name = tensor<string, []>("op_200"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_202 = const()[name = tensor<string, []>("op_202"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_47_pad_type_0 = const()[name = tensor<string, []>("input_47_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_47_pad_0 = const()[name = tensor<string, []>("input_47_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [128, 1, 3, 3]> image_encoder_model_network_2_0_token_mixer_reparam_conv_weight_to_fp16 = const()[name = tensor<string, []>("image_encoder_model_network_2_0_token_mixer_reparam_conv_weight_to_fp16"), val = tensor<fp16, [128, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(175424)))];
            tensor<fp16, [128]> image_encoder_model_network_2_0_token_mixer_reparam_conv_bias_to_fp16 = const()[name = tensor<string, []>("image_encoder_model_network_2_0_token_mixer_reparam_conv_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(177792)))];
            tensor<fp16, [1, 128, 32, 32]> input_47_cast_fp16 = conv(bias = image_encoder_model_network_2_0_token_mixer_reparam_conv_bias_to_fp16, dilations = var_202, groups = var_15, pad = input_47_pad_0, pad_type = input_47_pad_type_0, strides = var_200, weight = image_encoder_model_network_2_0_token_mixer_reparam_conv_weight_to_fp16, x = var_187_cast_fp16)[name = tensor<string, []>("input_47_cast_fp16")];
            tensor<int32, [2]> var_211 = const()[name = tensor<string, []>("op_211"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_213 = const()[name = tensor<string, []>("op_213"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_49_pad_type_0 = const()[name = tensor<string, []>("input_49_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_49_pad_0 = const()[name = tensor<string, []>("input_49_pad_0"), val = tensor<int32, [4]>([3, 3, 3, 3])];
            tensor<fp16, [128, 1, 7, 7]> input_51_weight_0_to_fp16 = const()[name = tensor<string, []>("input_51_weight_0_to_fp16"), val = tensor<fp16, [128, 1, 7, 7]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(178112)))];
            tensor<fp16, [128]> input_51_bias_0_to_fp16 = const()[name = tensor<string, []>("input_51_bias_0_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(190720)))];
            tensor<fp16, [1, 128, 32, 32]> input_51_cast_fp16 = conv(bias = input_51_bias_0_to_fp16, dilations = var_213, groups = var_15, pad = input_49_pad_0, pad_type = input_49_pad_type_0, strides = var_211, weight = input_51_weight_0_to_fp16, x = input_47_cast_fp16)[name = tensor<string, []>("input_51_cast_fp16")];
            tensor<int32, [2]> var_223 = const()[name = tensor<string, []>("op_223"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_225 = const()[name = tensor<string, []>("op_225"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_53_pad_type_0 = const()[name = tensor<string, []>("input_53_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_53_pad_0 = const()[name = tensor<string, []>("input_53_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [384, 128, 1, 1]> image_encoder_model_network_2_0_convffn_fc1_weight_to_fp16 = const()[name = tensor<string, []>("image_encoder_model_network_2_0_convffn_fc1_weight_to_fp16"), val = tensor<fp16, [384, 128, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(191040)))];
            tensor<fp16, [384]> image_encoder_model_network_2_0_convffn_fc1_bias_to_fp16 = const()[name = tensor<string, []>("image_encoder_model_network_2_0_convffn_fc1_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(289408)))];
            tensor<fp16, [1, 384, 32, 32]> input_53_cast_fp16 = conv(bias = image_encoder_model_network_2_0_convffn_fc1_bias_to_fp16, dilations = var_225, groups = var_5, pad = input_53_pad_0, pad_type = input_53_pad_type_0, strides = var_223, weight = image_encoder_model_network_2_0_convffn_fc1_weight_to_fp16, x = input_51_cast_fp16)[name = tensor<string, []>("input_53_cast_fp16")];
            tensor<string, []> var_228_mode_0 = const()[name = tensor<string, []>("op_228_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 384, 32, 32]> var_228_cast_fp16 = gelu(mode = var_228_mode_0, x = input_53_cast_fp16)[name = tensor<string, []>("op_228_cast_fp16")];
            tensor<int32, [2]> var_232 = const()[name = tensor<string, []>("op_232"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_234 = const()[name = tensor<string, []>("op_234"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_57_pad_type_0 = const()[name = tensor<string, []>("input_57_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_57_pad_0 = const()[name = tensor<string, []>("input_57_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [128, 384, 1, 1]> var_238_weight_0_to_fp16 = const()[name = tensor<string, []>("op_238_weight_0_to_fp16"), val = tensor<fp16, [128, 384, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(290240)))];
            tensor<fp16, [128]> var_238_bias_0_to_fp16 = const()[name = tensor<string, []>("op_238_bias_0_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(388608)))];
            tensor<fp16, [1, 128, 32, 32]> var_238_cast_fp16 = conv(bias = var_238_bias_0_to_fp16, dilations = var_234, groups = var_5, pad = input_57_pad_0, pad_type = input_57_pad_type_0, strides = var_232, weight = var_238_weight_0_to_fp16, x = var_228_cast_fp16)[name = tensor<string, []>("op_238_cast_fp16")];
            tensor<fp16, [1, 128, 32, 32]> var_239_cast_fp16 = add(x = input_47_cast_fp16, y = var_238_cast_fp16)[name = tensor<string, []>("op_239_cast_fp16")];
            tensor<int32, [2]> var_246 = const()[name = tensor<string, []>("op_246"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_248 = const()[name = tensor<string, []>("op_248"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_59_pad_type_0 = const()[name = tensor<string, []>("input_59_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_59_pad_0 = const()[name = tensor<string, []>("input_59_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [128, 1, 3, 3]> image_encoder_model_network_2_1_token_mixer_reparam_conv_weight_to_fp16 = const()[name = tensor<string, []>("image_encoder_model_network_2_1_token_mixer_reparam_conv_weight_to_fp16"), val = tensor<fp16, [128, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(388928)))];
            tensor<fp16, [128]> image_encoder_model_network_2_1_token_mixer_reparam_conv_bias_to_fp16 = const()[name = tensor<string, []>("image_encoder_model_network_2_1_token_mixer_reparam_conv_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(391296)))];
            tensor<fp16, [1, 128, 32, 32]> input_59_cast_fp16 = conv(bias = image_encoder_model_network_2_1_token_mixer_reparam_conv_bias_to_fp16, dilations = var_248, groups = var_15, pad = input_59_pad_0, pad_type = input_59_pad_type_0, strides = var_246, weight = image_encoder_model_network_2_1_token_mixer_reparam_conv_weight_to_fp16, x = var_239_cast_fp16)[name = tensor<string, []>("input_59_cast_fp16")];
            tensor<int32, [2]> var_257 = const()[name = tensor<string, []>("op_257"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_259 = const()[name = tensor<string, []>("op_259"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_61_pad_type_0 = const()[name = tensor<string, []>("input_61_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_61_pad_0 = const()[name = tensor<string, []>("input_61_pad_0"), val = tensor<int32, [4]>([3, 3, 3, 3])];
            tensor<fp16, [128, 1, 7, 7]> input_63_weight_0_to_fp16 = const()[name = tensor<string, []>("input_63_weight_0_to_fp16"), val = tensor<fp16, [128, 1, 7, 7]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(391616)))];
            tensor<fp16, [128]> input_63_bias_0_to_fp16 = const()[name = tensor<string, []>("input_63_bias_0_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(404224)))];
            tensor<fp16, [1, 128, 32, 32]> input_63_cast_fp16 = conv(bias = input_63_bias_0_to_fp16, dilations = var_259, groups = var_15, pad = input_61_pad_0, pad_type = input_61_pad_type_0, strides = var_257, weight = input_63_weight_0_to_fp16, x = input_59_cast_fp16)[name = tensor<string, []>("input_63_cast_fp16")];
            tensor<int32, [2]> var_269 = const()[name = tensor<string, []>("op_269"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_271 = const()[name = tensor<string, []>("op_271"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_65_pad_type_0 = const()[name = tensor<string, []>("input_65_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_65_pad_0 = const()[name = tensor<string, []>("input_65_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [384, 128, 1, 1]> image_encoder_model_network_2_1_convffn_fc1_weight_to_fp16 = const()[name = tensor<string, []>("image_encoder_model_network_2_1_convffn_fc1_weight_to_fp16"), val = tensor<fp16, [384, 128, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(404544)))];
            tensor<fp16, [384]> image_encoder_model_network_2_1_convffn_fc1_bias_to_fp16 = const()[name = tensor<string, []>("image_encoder_model_network_2_1_convffn_fc1_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(502912)))];
            tensor<fp16, [1, 384, 32, 32]> input_65_cast_fp16 = conv(bias = image_encoder_model_network_2_1_convffn_fc1_bias_to_fp16, dilations = var_271, groups = var_5, pad = input_65_pad_0, pad_type = input_65_pad_type_0, strides = var_269, weight = image_encoder_model_network_2_1_convffn_fc1_weight_to_fp16, x = input_63_cast_fp16)[name = tensor<string, []>("input_65_cast_fp16")];
            tensor<string, []> var_274_mode_0 = const()[name = tensor<string, []>("op_274_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 384, 32, 32]> var_274_cast_fp16 = gelu(mode = var_274_mode_0, x = input_65_cast_fp16)[name = tensor<string, []>("op_274_cast_fp16")];
            tensor<int32, [2]> var_278 = const()[name = tensor<string, []>("op_278"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_280 = const()[name = tensor<string, []>("op_280"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_69_pad_type_0 = const()[name = tensor<string, []>("input_69_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_69_pad_0 = const()[name = tensor<string, []>("input_69_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [128, 384, 1, 1]> var_284_weight_0_to_fp16 = const()[name = tensor<string, []>("op_284_weight_0_to_fp16"), val = tensor<fp16, [128, 384, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(503744)))];
            tensor<fp16, [128]> var_284_bias_0_to_fp16 = const()[name = tensor<string, []>("op_284_bias_0_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(602112)))];
            tensor<fp16, [1, 128, 32, 32]> var_284_cast_fp16 = conv(bias = var_284_bias_0_to_fp16, dilations = var_280, groups = var_5, pad = input_69_pad_0, pad_type = input_69_pad_type_0, strides = var_278, weight = var_284_weight_0_to_fp16, x = var_274_cast_fp16)[name = tensor<string, []>("op_284_cast_fp16")];
            tensor<fp16, [1, 128, 32, 32]> var_285_cast_fp16 = add(x = input_59_cast_fp16, y = var_284_cast_fp16)[name = tensor<string, []>("op_285_cast_fp16")];
            tensor<int32, [2]> var_292 = const()[name = tensor<string, []>("op_292"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_294 = const()[name = tensor<string, []>("op_294"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_71_pad_type_0 = const()[name = tensor<string, []>("input_71_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_71_pad_0 = const()[name = tensor<string, []>("input_71_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [128, 1, 3, 3]> image_encoder_model_network_2_2_token_mixer_reparam_conv_weight_to_fp16 = const()[name = tensor<string, []>("image_encoder_model_network_2_2_token_mixer_reparam_conv_weight_to_fp16"), val = tensor<fp16, [128, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(602432)))];
            tensor<fp16, [128]> image_encoder_model_network_2_2_token_mixer_reparam_conv_bias_to_fp16 = const()[name = tensor<string, []>("image_encoder_model_network_2_2_token_mixer_reparam_conv_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(604800)))];
            tensor<fp16, [1, 128, 32, 32]> input_71_cast_fp16 = conv(bias = image_encoder_model_network_2_2_token_mixer_reparam_conv_bias_to_fp16, dilations = var_294, groups = var_15, pad = input_71_pad_0, pad_type = input_71_pad_type_0, strides = var_292, weight = image_encoder_model_network_2_2_token_mixer_reparam_conv_weight_to_fp16, x = var_285_cast_fp16)[name = tensor<string, []>("input_71_cast_fp16")];
            tensor<int32, [2]> var_303 = const()[name = tensor<string, []>("op_303"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_305 = const()[name = tensor<string, []>("op_305"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_73_pad_type_0 = const()[name = tensor<string, []>("input_73_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_73_pad_0 = const()[name = tensor<string, []>("input_73_pad_0"), val = tensor<int32, [4]>([3, 3, 3, 3])];
            tensor<fp16, [128, 1, 7, 7]> input_75_weight_0_to_fp16 = const()[name = tensor<string, []>("input_75_weight_0_to_fp16"), val = tensor<fp16, [128, 1, 7, 7]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(605120)))];
            tensor<fp16, [128]> input_75_bias_0_to_fp16 = const()[name = tensor<string, []>("input_75_bias_0_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(617728)))];
            tensor<fp16, [1, 128, 32, 32]> input_75_cast_fp16 = conv(bias = input_75_bias_0_to_fp16, dilations = var_305, groups = var_15, pad = input_73_pad_0, pad_type = input_73_pad_type_0, strides = var_303, weight = input_75_weight_0_to_fp16, x = input_71_cast_fp16)[name = tensor<string, []>("input_75_cast_fp16")];
            tensor<int32, [2]> var_315 = const()[name = tensor<string, []>("op_315"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_317 = const()[name = tensor<string, []>("op_317"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_77_pad_type_0 = const()[name = tensor<string, []>("input_77_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_77_pad_0 = const()[name = tensor<string, []>("input_77_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [384, 128, 1, 1]> image_encoder_model_network_2_2_convffn_fc1_weight_to_fp16 = const()[name = tensor<string, []>("image_encoder_model_network_2_2_convffn_fc1_weight_to_fp16"), val = tensor<fp16, [384, 128, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(618048)))];
            tensor<fp16, [384]> image_encoder_model_network_2_2_convffn_fc1_bias_to_fp16 = const()[name = tensor<string, []>("image_encoder_model_network_2_2_convffn_fc1_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(716416)))];
            tensor<fp16, [1, 384, 32, 32]> input_77_cast_fp16 = conv(bias = image_encoder_model_network_2_2_convffn_fc1_bias_to_fp16, dilations = var_317, groups = var_5, pad = input_77_pad_0, pad_type = input_77_pad_type_0, strides = var_315, weight = image_encoder_model_network_2_2_convffn_fc1_weight_to_fp16, x = input_75_cast_fp16)[name = tensor<string, []>("input_77_cast_fp16")];
            tensor<string, []> var_320_mode_0 = const()[name = tensor<string, []>("op_320_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 384, 32, 32]> var_320_cast_fp16 = gelu(mode = var_320_mode_0, x = input_77_cast_fp16)[name = tensor<string, []>("op_320_cast_fp16")];
            tensor<int32, [2]> var_324 = const()[name = tensor<string, []>("op_324"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_326 = const()[name = tensor<string, []>("op_326"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_81_pad_type_0 = const()[name = tensor<string, []>("input_81_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_81_pad_0 = const()[name = tensor<string, []>("input_81_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [128, 384, 1, 1]> var_330_weight_0_to_fp16 = const()[name = tensor<string, []>("op_330_weight_0_to_fp16"), val = tensor<fp16, [128, 384, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(717248)))];
            tensor<fp16, [128]> var_330_bias_0_to_fp16 = const()[name = tensor<string, []>("op_330_bias_0_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(815616)))];
            tensor<fp16, [1, 128, 32, 32]> var_330_cast_fp16 = conv(bias = var_330_bias_0_to_fp16, dilations = var_326, groups = var_5, pad = input_81_pad_0, pad_type = input_81_pad_type_0, strides = var_324, weight = var_330_weight_0_to_fp16, x = var_320_cast_fp16)[name = tensor<string, []>("op_330_cast_fp16")];
            tensor<fp16, [1, 128, 32, 32]> var_331_cast_fp16 = add(x = input_71_cast_fp16, y = var_330_cast_fp16)[name = tensor<string, []>("op_331_cast_fp16")];
            tensor<int32, [2]> var_338 = const()[name = tensor<string, []>("op_338"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_340 = const()[name = tensor<string, []>("op_340"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_83_pad_type_0 = const()[name = tensor<string, []>("input_83_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_83_pad_0 = const()[name = tensor<string, []>("input_83_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<fp16, [128, 1, 3, 3]> image_encoder_model_network_2_3_token_mixer_reparam_conv_weight_to_fp16 = const()[name = tensor<string, []>("image_encoder_model_network_2_3_token_mixer_reparam_conv_weight_to_fp16"), val = tensor<fp16, [128, 1, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(815936)))];
            tensor<fp16, [128]> image_encoder_model_network_2_3_token_mixer_reparam_conv_bias_to_fp16 = const()[name = tensor<string, []>("image_encoder_model_network_2_3_token_mixer_reparam_conv_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(818304)))];
            tensor<fp16, [1, 128, 32, 32]> input_83_cast_fp16 = conv(bias = image_encoder_model_network_2_3_token_mixer_reparam_conv_bias_to_fp16, dilations = var_340, groups = var_15, pad = input_83_pad_0, pad_type = input_83_pad_type_0, strides = var_338, weight = image_encoder_model_network_2_3_token_mixer_reparam_conv_weight_to_fp16, x = var_331_cast_fp16)[name = tensor<string, []>("input_83_cast_fp16")];
            tensor<int32, [2]> var_349 = const()[name = tensor<string, []>("op_349"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_351 = const()[name = tensor<string, []>("op_351"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_85_pad_type_0 = const()[name = tensor<string, []>("input_85_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_85_pad_0 = const()[name = tensor<string, []>("input_85_pad_0"), val = tensor<int32, [4]>([3, 3, 3, 3])];
            tensor<fp16, [128, 1, 7, 7]> input_87_weight_0_to_fp16 = const()[name = tensor<string, []>("input_87_weight_0_to_fp16"), val = tensor<fp16, [128, 1, 7, 7]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(818624)))];
            tensor<fp16, [128]> input_87_bias_0_to_fp16 = const()[name = tensor<string, []>("input_87_bias_0_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(831232)))];
            tensor<fp16, [1, 128, 32, 32]> input_87_cast_fp16 = conv(bias = input_87_bias_0_to_fp16, dilations = var_351, groups = var_15, pad = input_85_pad_0, pad_type = input_85_pad_type_0, strides = var_349, weight = input_87_weight_0_to_fp16, x = input_83_cast_fp16)[name = tensor<string, []>("input_87_cast_fp16")];
            tensor<int32, [2]> var_361 = const()[name = tensor<string, []>("op_361"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_363 = const()[name = tensor<string, []>("op_363"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_89_pad_type_0 = const()[name = tensor<string, []>("input_89_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_89_pad_0 = const()[name = tensor<string, []>("input_89_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [384, 128, 1, 1]> image_encoder_model_network_2_3_convffn_fc1_weight_to_fp16 = const()[name = tensor<string, []>("image_encoder_model_network_2_3_convffn_fc1_weight_to_fp16"), val = tensor<fp16, [384, 128, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(831552)))];
            tensor<fp16, [384]> image_encoder_model_network_2_3_convffn_fc1_bias_to_fp16 = const()[name = tensor<string, []>("image_encoder_model_network_2_3_convffn_fc1_bias_to_fp16"), val = tensor<fp16, [384]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(929920)))];
            tensor<fp16, [1, 384, 32, 32]> input_89_cast_fp16 = conv(bias = image_encoder_model_network_2_3_convffn_fc1_bias_to_fp16, dilations = var_363, groups = var_5, pad = input_89_pad_0, pad_type = input_89_pad_type_0, strides = var_361, weight = image_encoder_model_network_2_3_convffn_fc1_weight_to_fp16, x = input_87_cast_fp16)[name = tensor<string, []>("input_89_cast_fp16")];
            tensor<string, []> var_366_mode_0 = const()[name = tensor<string, []>("op_366_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 384, 32, 32]> var_366_cast_fp16 = gelu(mode = var_366_mode_0, x = input_89_cast_fp16)[name = tensor<string, []>("op_366_cast_fp16")];
            tensor<int32, [2]> var_370 = const()[name = tensor<string, []>("op_370"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> var_372 = const()[name = tensor<string, []>("op_372"), val = tensor<int32, [2]>([1, 1])];
            tensor<string, []> input_93_pad_type_0 = const()[name = tensor<string, []>("input_93_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_93_pad_0 = const()[name = tensor<string, []>("input_93_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [128, 384, 1, 1]> var_376_weight_0_to_fp16 = const()[name = tensor<string, []>("op_376_weight_0_to_fp16"), val = tensor<fp16, [128, 384, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(930752)))];
            tensor<fp16, [128]> var_376_bias_0_to_fp16 = const()[name = tensor<string, []>("op_376_bias_0_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1029120)))];
            tensor<fp16, [1, 128, 32, 32]> var_376_cast_fp16 = conv(bias = var_376_bias_0_to_fp16, dilations = var_372, groups = var_5, pad = input_93_pad_0, pad_type = input_93_pad_type_0, strides = var_370, weight = var_376_weight_0_to_fp16, x = var_366_cast_fp16)[name = tensor<string, []>("op_376_cast_fp16")];
